# Data Frame

DataFrame is considered to be an extension to Series by extending it to multiple dimension. It is used with pandas package.

In [2]:
import pandas as pd
data = {
    'color': ['blue','green','yellow','red','black'],
    'items' : ['ball','pen','pencil','marker','mug'],
    'price' : [2.5,1.2,0.6,4.5,9]
}
myframe = pd.DataFrame(data)
myframe

    color   items  price
0    blue    ball    2.5
1   green     pen    1.2
2  yellow  pencil    0.6
3     red  marker    4.5
4   black     mug    9.0

In [3]:
mydata = {
    'Employee Name' : ['Muthu', 'Ali','Cheong'],
    'Skillset' : ['Python','Powerpoint','Tablue'],
    'Experience(years)' : [4,5,2]
}

myframe = pd.DataFrame(mydata)
myframe

  Employee Name    Skillset  Experience(years)
0         Muthu      Python                  4
1           Ali  Powerpoint                  5
2        Cheong      Tablue                  2

In [4]:
# Selecting specific columns for display from existing DataFrame. This is order-dependent

myframe2 = pd.DataFrame(mydata, columns = ['Experience(years)','Employee Name'])
myframe2

   Experience(years) Employee Name
0                  4         Muthu
1                  5           Ali
2                  2        Cheong

We can alter the index of a Data Frame using the snippet below

In [5]:
myframe3 = pd.DataFrame(mydata, index = ['zero','one',2])
myframe3

     Employee Name    Skillset  Experience(years)
zero         Muthu      Python                  4
one            Ali  Powerpoint                  5
2           Cheong      Tablue                  2

In [6]:
myframe3 = pd.DataFrame(mydata, index = ['zero','one','two'])
myframe3

     Employee Name    Skillset  Experience(years)
zero         Muthu      Python                  4
one            Ali  Powerpoint                  5
two         Cheong      Tablue                  2

In [7]:
import numpy as np

np.arange(15).reshape((3,5)) 
# Generates number from 0 to 14, creates 3x5 matrices

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

One can also use operators in a DataFrame

In [8]:
# Applying conditional operator in DataFrame

myframe3[myframe3['Experience(years)']>4]

    Employee Name    Skillset  Experience(years)
one           Ali  Powerpoint                  5

In [10]:
# The DataFrame table can also be transposed by using dataframe.T 

myframe3.T

                     zero         one     two
Employee Name       Muthu         Ali  Cheong
Skillset           Python  Powerpoint  Tablue
Experience(years)       4           5       2